In [2]:
import numpy as np
import pandas as pd

시리즈 생성2

In [12]:
# 인덱스를 직접 설정하여 시리즈 생성
# pd.Series(값목록(list), 인덱스(list))
s = pd.Series([1,2,3], index = ['a','b','c'])
s
# 인덱스 확인
s.index

Index(['a', 'b', 'c'], dtype='object')

시리즈에서 값 꺼내기
값을 찾는 방법: 인덱스의 이름과 위치<br>
loc 함수: 인덱스 이름으로 데이터를 찾는다<br>
iloc 함수: 인덱스 위치로 데이터를 찾는다<br>
대괄호[]: 인덱스 이름으로 데이터를 찾는다

In [15]:
print(s)
# 이 시리즈의 인덱스 이름: a, b, c
# 이 시리즈의 인덱스 위치: 0, 1, 2 
# 인덱스 이름으로 숫자 1 꺼내기
s.loc['a']
# 인덱스 이름으로 숫자 2 꺼내기
s['b']
# 인덱스 위치로 숫자 3 꺼내기
s.iloc[2]

a    1
b    2
c    3
dtype: int64

np.int64(3)

시리즈 값 수정하기

In [22]:
print(s)
# 1을 0으로 변경
# 찾기 -> 변경
s.loc['a'] = 0
s['c'] = 99
s

a     0
b     2
c    99
dtype: int64

a     0
b     2
c    99
dtype: int64

In [38]:
a = pd.Series([70,80,90], index = ['국어', '영어', '수학'])
print(a)
a.loc['국어']
a['수학'] = 75
a

국어    70
영어    80
수학    90
dtype: int64

국어    70
영어    80
수학    75
dtype: int64

In [39]:
season = pd.Series([15,27,18], index = ['봄', '여름','가을'])
print(season)

봄     15
여름    27
가을    18
dtype: int64

In [41]:
season.loc['봄']

np.int64(15)

In [42]:
season['가을'] = 20
season

봄     15
여름    27
가을    20
dtype: int64

In [43]:
data = pd.Series([1000, 1200, 1300], ['01-01', '01-02', '01-03'])
print(data)

01-01    1000
01-02    1200
01-03    1300
dtype: int64

In [44]:
data.loc['01-01']

np.int64(1000)

In [46]:
data['01-02'] = 1250
data

01-01    1000
01-02    1250
01-03    1300
dtype: int64

In [47]:
day = pd.Series([300,400,500], index = ['월', '화', '수'])
day

월    300
화    400
수    500
dtype: int64

In [48]:
day.loc['화']

np.int64(400)

In [50]:
day['수'] = 550
day

월    300
화    400
수    550
dtype: int64

In [56]:
data = { 'name' : ['철수', '영희', '민수'],
         'math' : [85, 90, 78]}
df = pd.DataFrame(data)
print(df.index)
df.columns

RangeIndex(start=0, stop=3, step=1)

Index(['name', 'math'], dtype='object')

In [55]:
data = {'day': ['월','화','수'],
        'sales': [1000, 1200, 900]}
df = pd.DataFrame(data)
df

  day  sales
0   월   1000
1   화   1200
2   수    900

In [63]:
data = np.array([[30,50],[20,40]])
df = pd.DataFrame(data,
                  index=['사과','배'],
                  columns=['판매량','재고'])
print(df)
df.insert(2, '가격', [1000,2000])
df

    판매량  재고
사과   30  50
배    20  40

    판매량  재고    가격
사과   30  50  1000
배    20  40  2000

In [64]:
# loc iloc []
# 사과의 판매량
df.loc[ '사과', '판매량']

np.int64(30)

In [79]:
data = np.array([[950, 1200],[500, 800]])
df = pd.DataFrame(data,
                  index=['서울', '부산'],
                  columns=['인구','면적'])

df.insert(2, '특산물', ['김치','어묵'])
df

     인구    면적 특산물
서울  950  1200  김치
부산  500   800  어묵

In [80]:
df.loc['서울', '면적']

np.int64(1200)

In [82]:
data = np.array([[15000, '홍길동전'],[20000, '해리포터']])
df = pd.DataFrame(data,
                  index=['책1', '책2'],
                  columns=['가격','제목'])

df.insert(1, '저자', ['허균','j.k. 롤링'])
df

       가격       저자    제목
책1  15000       허균  홍길동전
책2  20000  j.k. 롤링  해리포터

In [85]:
df.loc['책2', '가격']

'20000'

In [103]:
data = np.array([[9.0, 14000],[8.2, 9500]])

df = pd.DataFrame(data,
                  index=['기생충', '인터스텔라'],
                  columns=['평점', '관객수'])
df

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [97]:
df.loc['기생충', '평점']

np.float64(9.0)

In [105]:
df = df.drop('관객수', axis=1)
df

        평점
기생충    9.0
인터스텔라  8.2

In [127]:
data = pd.Series([80,90,75,85], index = ['국어','영어','수학','과학'])
print('총점:', data.sum())
print('평균:', data.mean())
print('최고 점수:', data.max())
print('최저 점수:', data.min())

총점: 330
평균: 82.5
최고 점수: 90
최저 점수: 75

In [132]:
s = pd.Series([2, 5, -1, 0, 7, -3, 4],
              index = ['월','화','수','목','금','토','일'])
s >= 0
s[s >= 0]

월    2
화    5
목    0
금    7
일    4
dtype: int64

데이터 프레임에서 계산과 처리

In [135]:
# 학생 성적 데이터 만들기
data = np.array([[60,70,80], [70,80,90], [80,90,10]])
# 성적데이터를 담아서 프레임 생성
df = pd.DataFrame(data,
                 index=['둘리','또치','도우너'],
                 columns=['국어','영어','수학'])
df

     국어  영어  수학
둘리   60  70  80
또치   70  80  90
도우너  80  90  10

In [139]:
# 국어 과목만 조회
df['국어']
# 국어 과목에 담겨있는 값의 자료형
df['국어'].dtype
# 국어 과목의 자료 구조
type(df['국어'])
# 데이터 프레임은 여러 시리즈의 묶음

pandas.core.series.Series

In [140]:
# 전체 점수에 1점씩 더하기
# 데이터 프레임 전체 데이터에 더하기가 적용됨
df + 1
# 국어 점수만 10점씩 더하기
df['국어'] + 1

둘리     61
또치     71
도우너    81
Name: 국어, dtype: int64

In [141]:
# 조건 검색( 국어점수가 70점 이상인 학생만 찾기)
df['국어'] >= 70
# 프레임에 bool 배열을 인덱스로 사용
df[df['국어'] >= 70]

     국어  영어  수학
또치   70  80  90
도우너  80  90  10

In [144]:
data = np.array([[12000, 9.0], [8000, 8.5], [15000, 9.3]])

df = pd.DataFrame(data,
                 index=['기생충','인터스텔라','아바타'],
                 columns=['관객수','평점'])
df
df['관객수'] + 1000

기생충      13000.0
인터스텔라     9000.0
아바타      16000.0
Name: 관객수, dtype: float64

In [148]:
df['평점'] >= 9.0
df[df['평점'] >= 9.0]

         관객수   평점
기생충  12000.0  9.0
아바타  15000.0  9.3

In [178]:
data = np.array([[25000, 30000], [40000, 15000]])

df = pd.DataFrame(data,
                 index=['치마', '바지'],
                 columns=['1월 매출','2월 매춤'])
df

    1월 매출  2월 매춤
치마  25000  30000
바지  40000  15000

In [184]:
print(df['1월 매출'])
print(df['2월 매출'])
df['1월 매출'] + df['2월 매출']
df['합계'] = df['1월 매출'] + df['2월 매출']
df

치마    25000
바지    40000
Name: 1월 매출, dtype: int64

KeyError: '2월 매출'

In [186]:
data = np.array([[20,25,15], [18,22,19], [25,27,23]])

df = pd.DataFrame(data,
                 index=['서울','부산','대구'],
                 columns=['봄','여름', '겨울'])
df

     봄  여름  겨울
서울  20  25  15
부산  18  22  19
대구  25  27  23

In [187]:
df.loc['서울','여름'] = np.nan
df

     봄    여름  겨울
서울  20   NaN  15
부산  18  22.0  19
대구  25  27.0  23

In [188]:
df = df.dropna(axis=0)
df

     봄    여름  겨울
부산  18  22.0  19
대구  25  27.0  23

In [190]:
df.loc['부산','봄'] = np.nan
df

       봄    여름  겨울
부산   NaN  22.0  19
대구  25.0  27.0  23

In [191]:
df.fillna(0)

       봄    여름  겨울
부산   0.0  22.0  19
대구  25.0  27.0  23

In [196]:
data = np.array([[80,75,90], [85,88,82], [70,65,78]])

df = pd.DataFrame(data,
                 index=['국어','영어','수학'],
                 columns=['1반','2반', '3반'])
df

    1반  2반  3반
국어  80  75  90
영어  85  88  82
수학  70  65  78

In [197]:
df.loc['영어','2반'] = np.nan
df

    1반    2반  3반
국어  80  75.0  90
영어  85   NaN  82
수학  70  65.0  78

In [198]:
df = df.dropna(axis=1)
df

    1반  3반
국어  80  90
영어  85  82
수학  70  78

In [199]:
df.loc['수학','3반'] = np.nan
df

    1반    3반
국어  80  90.0
영어  85  82.0
수학  70   NaN

In [200]:
df.fillna(100)

    1반     3반
국어  80   90.0
영어  85   82.0
수학  70  100.0